data/perf/campaign-f3deebfbab60/flag-memcached/memcached/tsan-nofe/warmup1/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       181111.95          ---          ---         4.24464         3.93500        10.43100        13.37500     12360.84 
Gets      1811099.54      1454.31   1809645.23         4.16598         3.87100        10.23900        13.18300     45874.05 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1992211.49      1454.31   1809645.23         4.17313         3.87100        10.23900        13.18300     58234.89 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       167542.34          ---          ---         4.48961         4.25500        10.49500        13.37500     11434.71 
Gets      1675405.00       735.89   1674669.11         4.39723         4.15900        10.30300        13.24700     42400.17 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1842947.34       735.89   1674669.11         4.40562         4.19100        10.30300        13.24700     53834.88 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       173152.27          ---          ---         4.36601         4.06300        10.43100        13.31100     11817.59 
Gets      1731503.62      1268.51   1730235.12         4.28073         3.98300        10.30300        13.18300     43850.57 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1904655.89      1268.51   1730235.12         4.28848         3.98300        10.30300        13.18300     55668.16